CREATE VIEW dbo.[ОрендаторП] AS	
SELECT DISTINCT [Код орендатора], [Прізвище], [Ім'я] FROM Орендатор
GO 

CREATE VIEW ПрокатП AS	
SELECT DISTINCT * FROM [Прокат фільму]

SELECT * FROM ПрокатП
WHERE [Дата видачі] >='2020-05-06'

SELECT ОрендаторП.[Прізвище], ОрендаторП.[Ім'я], ПрокатП.[Дата повернення] as 'Закінчення прокату'
FROM [ОрендаторП], [ПрокатП]
WHERE ОрендаторП.[Код орендатора]= ПрокатП.[Код прокату]

SELECT ОрендаторП.Прізвище, ОрендаторП.[Ім'я], ПрокатП.[Дата повернення] as 'Дійсний до'
FROM ПрокатП, ОрендаторП
WHERE ОрендаторП.[Код орендатора]=ПрокатП.[Код прокату] 
AND ОрендаторП.[Код орендатора] IN (1,2)

