SELECT Телефон FROM Орендатор 
WHERE [Ім'я]='Андрій' AND Прізвище='Бой'

SELECT Прізвище, [Ім'я], [Дата видачі], [Дата повернення]
FROM Орендатор AS О
LEFT JOIN [Прокат фільму] AS П ON О.[Код орендатора]= П.[Код прокату]

SELECT [Назва жанру], 
(SELECT Прізвище FROM Орендатор WHERE П.[Код прокату]=Орендатор.[Код орендатора]) 
as Прізвище,
[Дата видачі], [Дата повернення]
FROM [Прокат фільму] AS П
INNER JOIN [Жанр фільму] AS Ж ON [Назва жанру] = 'Драма' 
AND Ж.[Код жанру] = П.[Код прокату]

SELECT * FROM Орендатор
WHERE NOT EXISTS
(SELECT [Код прокату] FROM [Прокат фільму] 
WHERE [Прокат фільму].[Код прокату]=Орендатор.[Код орендатора])

SELECT Прізвище, [Ім'я] FROM Орендатор, [Прокат фільму]
WHERE Орендатор.[Код орендатора]=[Прокат фільму].[Код прокату]
AND [Дата видачі]>'2020-05-01'
AND [Дата повернення]<'2020-05-20'
